In [5]:
import pandas as pd
df = pd.read_csv("C:\\Users\\Lenovo\\Desktop\\Python\\Practice\\Numpy\\zoo.csv")
print(len(df))

22

In [4]:
n = df['water_need'].max()
print(df['uniq_id'][df['water_need']==n])

1     1002
16    1017
Name: uniq_id, dtype: int64

In [10]:
print(df['water_need'][df['uniq_id']==1017])

16    600
Name: water_need, dtype: int64

In [50]:
print(df['water_need'].mean())

347.72727272727275

In [11]:
data={'Names':['Naveen','Dileep','Dinesh','Sathish'],'age':[22,21,25,28]}
df = pd.DataFrame(data)
print(df)

     Names  age
0   Naveen   22
1   Dileep   21
2   Dinesh   25
3  Sathish   28

In [54]:
print(df.shape)
rows,columns=df.shape
print(rows)
print(columns)

(4, 2)
4
2

In [25]:
import pandas as pd
df = pd.read_csv("C:\\Users\\Lenovo\\Desktop\\Python\\Practice\\Numpy\\zoo.csv")
df.head(12).animal
df.tail()

      animal  uniq_id  water_need
17      lion     1018         500
18      lion     1019         390
19  kangaroo     1020         410
20  kangaroo     1021         430
21  kangaroo     1022         410

In [26]:
df.columns

Index(['animal', 'uniq_id', 'water_need'], dtype='object')

In [27]:
df[df['water_need']>500]

      animal  uniq_id  water_need
1   elephant     1002         600
2   elephant     1003         550
16      lion     1017         600

In [28]:
df.set_index('uniq_id')

           animal  water_need
uniq_id
1001     elephant         500
1002     elephant         600
1003     elephant         550
1004        tiger         300
1005        tiger         320
1006        tiger         330
1007        tiger         290
1008        tiger         310
1009        zebra         200
1010        zebra         220
1011        zebra         240
1012        zebra         230
1013        zebra         220
1014        zebra         100
1015        zebra          80
1016         lion         420
1017         lion         600
1018         lion         500
1019         lion         390
1020     kangaroo         410
1021     kangaroo         430
1022     kangaroo         410

In [31]:
df['animal
'][df['uniq_id']==df['uniq_id'].max()]

Empty DataFrame
Columns: [animal, uniq_id, water_need]
Index: []